57-JWT-Auth/server/app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Charles"], ["LIMIT", 1]]
---
    def create
        # byebug
        user = User.find_by(username: params[:username])