57-JWT-Auth/server/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        # byebug
        # user = User.new(username: params[:username], password: params[:password])
        user = User.new(user_params)


        if user.valid?
            user.save